export type FlowerType = "daisy" | "forgetMeNot" | "rose" | "sunflower" | "tulip"

export function getFlowerType(score: number): FlowerType {
  if (score <= 11) {
    return "tulip"
  } else if (score <= 16) {
    return "rose"
  } else if (score <= 21) {
    return "daisy"
  } else if (score <= 25) {
    return "sunflower"
  } else if (score <= 28) {
    return "forgetMeNot"
  } else {
    return "tulip"
  }
}

export const flowerName: Record<FlowerType, string> = {
  daisy: "ดอกเดซี่",
  forgetMeNot: "ดอก Forget Me Not",
  rose: "ดอกกุหลาบ",
  sunflower: "ดอกทานตะวัน",
  tulip: "ดอกทิวลิป",
}

export const flowerDescription: Record<FlowerType, string> = {
  daisy:
    "คุณเป็นคนรักที่มากไปด้วยความสามารถและสเน่ห์อันน่าดึงดูด ชอบให้คนชื่นชมตัวเอง มากไปกว่านั้นคนรักในกลุ่มนี้เป็นคนที่จะทำตัวเป็นเหมือนเป็นที่พึ่งพาได้ ด้วยความสามารถในการดึงดูดและเรียกคะแนนความสนใจของคนรอบข้าง ทำให้คุณเป็นคนรักที่มีความสามารถในด้านการชักจูงและโน้มน้าวใจคนอื่นได้ดีเยี่ยม เข้าใจหัวอกและความรู้สึกคนอื่นได้เป็นอย่างดี แต่ทว่าในความมั่นใจต่าง ๆ นั้นก็เต็มไปด้วยความอ่อนไหวและ Emotional เสียเหลือเกิน",
  forgetMeNot:
    "ภายนอกดูเป็นคนเย็นชา ไม่ค่อยสนใจเรื่องรัก ๆ ใคร่ ๆ เท่าไหร่ เหมือนพวกโนสนโนแคร์ แต่แท้จริงแล้วไม่ใช่ เมื่อคุณมีความรักคุณจะให้พื้นที่กับคนรัก เพราะเขาเชื่อว่าคนทุกคนมีพื้นที่ของตนเอง ดูแลและเทคแคร์แบบห่าง ๆ อย่างห่วง ๆ แต่คุณก็กลัวที่จะเผชิญกับความผิดหวัง เมื่อเจอความสัมพันธ์ที่ Emotional จะรีบถอยออกมาทันทีเพราะรู้สึกเสียเวลาและเสียพลังงาน",
  rose: "คุณเป็นคนรักที่มีความร่าเริงสดใสตลอดเวลา คุณชอบเข้าสังคมและต้องการคนรักที่ไปกับคุณได้ด้วย คุณคิดว่าการสร้างความทรงจำร่วมกันในความสัมพันธ์เป็นเรื่องที่สำคัญ อยากจะชวนคนรักของคุณออกไปสร้างโมเมนต์สนุก ๆ ร่วมกันในสถานที่โรแมนติก ที่คุณตั้งทำการบ้านและหาข้อมูลมาอย่างดี",
  sunflower:
    "คุณเป็นคนรักที่เหมือนจะมีกำแพงป้องกันตนเองสูงมาก เพราะคุณจะเก่งมากกับหาเหตุผลหรือมองหาข้อบกพร่องของอีกฝ่าย เพื่อป้องกันตัวเองจากความผิดหวัง แต่หากเมื่อไหร่ที่ใครสามารถข้ามกำแพงของคุณมาได้แล้วคุณจะให้ความสำคัญและใส่ใจแฟนคุณมาก ๆ คุณจะวางภาพความสัมพันธ์ในอนาคตของคุณไว้เป็นอย่างดี แต่ในขณะเดียวกันคุณก็ยังต้องการ Space ส่วนตัวบ้างในความสัมพันธ์ด้วย",
  tulip:
    "คุณเป็นคนรักที่อารมณ์ดี ทำให้เขาสบายใจ พร้อมกล้าเปิดใจที่จะแสดงความคิดเห็นหรือพื้นที่ของตนเองให้กับผู้อื่นได้อย่างง่ายดาย อยู่ด้วยแล้วไม่เครียด ไม่มีกำแพงกั้นอะไรมากมาย ซื่อสัตย์อย่างตรงไปตรงมาในความสัมพันธ์ แต่คุณจะไม่ชอบเมื่อคนรักของคุณประชดประชัน หรือทำตัวงี่เง่าใส่ ไม่ชอบความอ้อมค้อม คุณต้องการคนรักที่สามารถเข้ากันได้ดีกับเพื่อนของคุณ",
}
